# Content List
### 01. Importing Libraries
### 02. Importing Data
### 03. Exercise 4.5
### 04. Task 4.5

# 01. Importing Libraries

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

# 02. Importing Data

In [2]:
# create path to main project folder
path = r'/Users/kirstinhelgeson/Desktop/Data Analytics Course/05-2023 Instacart Basket Analysis'

In [3]:
# import products.csv file
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

In [4]:
# import orders_wrangled.csv file
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

# 03. Exercise 4.5

In [5]:
# create a test dataframe
df_test = pd.DataFrame()

In [6]:
# create a mixed type column in df_test dataframe
df_test['mix'] = ['a','b',1, True]

In [7]:
# check the df_test dataframe created previously
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [8]:
# check for mixed types in df_test dataframe
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [9]:
# change data type in 'mix' column from 'mix' to 'str' within the df_test dataframe
df_test['mix'] = df_test['mix'].astype('str')

In [11]:
# check for missing observations in df_prods dataframe
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [12]:
# create a subset containing only the missing values under 'product_name' in the df_prods dataframe
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [13]:
# print subset df_nan
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [14]:
# check number of rows in df_prods dataframe
df_prods.shape

(49693, 5)

In [15]:
# create new subset removing missing values from df_prods
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [16]:
# check number of rows in df_prods_clean dataframe
df_prods_clean.shape

(49677, 5)

In [17]:
# create a subset of df_prods_clean containing only duplicates
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [18]:
# print subset df_dups dataframe containing only duplicates
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [19]:
# check number of rows in df_prods_clean dataframe
df_prods_clean.shape

(49677, 5)

In [20]:
# create a dataframe that doesn't include duplicates
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [21]:
# check number of rows in df_prods_clean_no_dups dataframe
df_prods_clean_no_dups.shape

(49672, 5)

In [22]:
# export df_prods_clean_no_dups dataframe as "products_checked.csv"
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'))

# 04. Task 4.5

In [25]:
# 2. Do basic statistical analysis for dataframe df_ords to check data quality
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

### 2. The data within df_ords seems consistent in each column. No unexpected maximums, minimums, means, or interquartile values.

In [27]:
# 3. Check for mixed types in df_ords dataframe
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

### 4. There are no mixed type columns printed under the previous command so there are no mixed types within the df_ords dataframe to adjust.

In [29]:
# 5. Check for missing observations in df_ords dataframe
df_ords.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [32]:
# 5. Create a subset containing only the missing values under 'days_since_prior_order' in the df_ords dataframe
df_ords_nan = df_ords[df_ords['days_since_prior_order'].isnull() == True]

In [33]:
# 5. Print df_ords_nan subset dataframe to see why 206209 values may be missing
df_ords_nan

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
11,11,2168274,2,1,2,11,NaN
26,26,1374495,3,1,1,14,NaN
39,39,3343014,4,1,6,11,NaN
45,45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,1,4,12,NaN
3420934,3420934,3189322,206206,1,3,18,NaN
3421002,3421002,2166133,206207,1,6,19,NaN
3421019,3421019,2227043,206208,1,1,15,NaN
3421069,3421069,3154581,206209,1,3,11,NaN

### 5. The 206209 values under 'days_since_prior_order' column are missing because they correspond with that particular order being the first order ever placed by a new user of instacart. There will not be any days since the previous order if that is the first order they have placed. The maximum value for the column 'user_id' is also 206209, so we are seeing a missing value every time there is a new customer.

### 6. I have chosen to not replace the missing values with anything numeric because we could not replace them with a number that would be meaningful. For instance, a value of '0' under days_since_prior_order would just mean that the previous order was placed earlier that day which is not the same as saying this is the first order a user has placed. I would not delete the values either because they make up such a large portion of the data and still represent useful information. We still gain statistical knowledge from this column with the NaN values present.

In [34]:
# 7. Create a subset of df_ords containing only duplicates
df_ords_dups = df_ords[df_ords.duplicated()]

In [35]:
# 7. Print df_ords_dups subset to observe any duplicate values
df_ords_dups

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order]
Index: []

### 7. There are no duplicates in the df_ords dataframe to address.

### 8. There are no duplicates in the df_ords dataframe to address.

In [36]:
# 9. Export df_ords dataframe as "orders_checked.csv"
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked.csv'))